/*************************************************************************
        > File Name: 03_进制.c
        > Author: 徐大帅
        > Mail: 2978615862@qq.com
        > Created Time: 2023年03月03日 星期五 15时39分03秒
 ************************************************************************/

#include <stdio.h>
int main(){

    //c语言不能直接写二进制
    int a=123;
    int b=0123;
    int c=0xABC;

    printf("%d,%d,%d",a,b,c);

    printf("八进制：%o,%o,%o",a,b,c);

    printf("十六进制：%x,%x,%x\n",a,b,c);

    return 0;
}
